mobile/pertemuan2/OneDrive_1_10-13-2025/akademik/app/Models/ModelPegawai.php

SELECT *
FROM `pegawai`
WHERE `pegawai`.`nip` = '001'
---
    public function findById($nip)
    {
        $data = $this->find($nip);