mobile/pertemuan2/OneDrive_1_10-13-2025/akademik/app/Models/ModelMahasiswa.php

SELECT *
FROM `mahasiswa`
WHERE `mahasiswa`.`nim` = '123'
---
    public function findById($nim)
    {
        $data = $this->find($nim);